<?php
error_reporting(-1);

//$arr =  array('Ivanov'. 'Petrov', 'Sidorov' );

//$goods = [
//  [
//      'title' => 'Nokia',
//      'price' => 100,
//      'description' => 'Description'
//  ],
//  [
//      'title' => 'iPad',
//      'price' => 200,
//      'description' => 'Description'
//  ]
//];

/*
 * count() - количество элементов массива
 * array_diff() - выводит эленты первого массива, отсутствующие во втором
 * array_intersec() - выводит элементы, имеющиеся в переданных массивах
 * array_key_exist() - проверяет на наличие ключей в массиве
 * array_keys() - возращаяет ключи массива
 * array_values() - возвращает значения массива
 * array_merge() - объединяет массивы в один, совпадающие строковые ключи перезаписываются
 * array_rand() - выбирает случайный ключ(и) массива
 * array_reverse() - переворачивает массив наоброт, с сохранением или без ключей
 * compact() - собирает массив из названий переменных
 * extract() - создает из массива переменные, ключи массива являются именами переменных
 * arsort() - сортирует массив в обратном алфавитном порядке, с сохранением ключей
 * asort() - сортирует массив в прямом алфавитном порядке, с сохранением ключей
 * rsort() - сортирует массив в обратном алфавитном порядке, ключи перезаписываются на числовые
 * sort() - сортирует массив в прямом алфавитном порядке, ключи перезаписываются на числовые
 *
 *
 * */
