<?php
error_reporting(-1);

/*
операторы
"+" - сложение
"-" - вычитание
"*" - умножение
"/" - деление
"-$a" - отрицание
"$a % $b" - деление по модулю(остаток от деления) 
"$a ** $b" - возведение в степень
(имеют приоритет, так же как и в математике, который можно изменить добавив скобки)
"=" - присваивание 
"&" - присваивание по  ссылке
"++$a" - префиксный инкремент 
"$a++" - постфискный инкремент
"--$a" - префиксный декремент
"$a--" - постфискный декремент
"." - конкатенация
комбинированные операторы
*/

// $a = 5;
// $a = $a + 1; // $a++
// var_dump($a); // 6

// $str1 = 'Hello';
// $str2 = 'World';
// $str = $str1 . $str2 ; 
// echo $str;

// $a = 5;
// $a = $a + 2;
// $a +=2;
// $a *=2;
// $str1 = 'Hello';
// $str1 .= ' world';

// NULL
// $var = '2';
// unset($var);
// var_dump($var); // null
// $var = NULL;
// $var++;
// var_dump($var); // 1


?>
